export const nodeList = {
  "data": {
    "admin_config": [{
      "title": "运营管理",
      "key": "1",
      "children": [
        {
          "title": "用户",
          "key": "1-4",
          "children": [
            {
              "title": "用户管理",
              "key": "1-4-1",
              "children": [
                { "title": "浏览用户", "key": "1-4-1-1" },
                { "title": "冻结用户", "key": "1-4-1-2" },
              ]
            },
            {
              "title": "种子用户管理",
              "key": "1-4-2",
              "children": [
                { "title": "浏览种子用户", "key": "1-4-2-1" }
              ]
            },
            {
              "title": "社交用户管理",
              "key": "1-4-3",
              "children": [
                { "title": "浏览社交用户", "key": "1-4-3-1" },
              ]
            },
            {
              "title": "运营虚拟账号",
              "key": "1-4-4",
              "children": [
                { "title": "新增虚拟账号", "key": "1-4-4-1" },
                { "title": "删除虚拟账号", "key": "1-4-4-2" },
                { "title": "编辑虚拟账号", "key": "1-4-4-3" }
              ]
            },
            {
              "title": "虚拟用户自动回复模板",
              "key": "1-4-5",
              "children": [
                { "title": "新增", "key": "1-4-5-1" },
                { "title": "删除", "key": "1-4-5-2" },
                { "title": "编辑", "key": "1-4-5-3" }
              ]
            },
            {
              "title": "用户认证审核",
              "key": "1-4-6",
              "children": [
                { "title": "新增", "key": "1-4-6-1" },
                { "title": "删除", "key": "1-4-6-2" },
                { "title": "编辑", "key": "1-4-6-3" }
              ]
            },
            {
              "title": "录播视频管理",
              "key": "1-4-7",
              "children": [
                { "title": "查询", "key": "1-4-7-1" },
              ]
            },
            {
              "title": "照片墙审核",
              "key": "1-4-8",
              "children": [
                { "title": "查询", "key": "1-4-8-1" },
                { "title": "审核", "key": "1-4-8-2" },
              ]
            },
          ]
        },
        {
          "title": "道具商城",
          "key": "1-5",
          "children": [
            { "title": "新增", "key": "1-5-1" },
            { "title": "删除", "key": "1-5-2" },
            { "title": "编辑", "key": "1-5-3" }
          ]
        },
        {
          "title": "视频道具管理",
          "key": "1-11",
          "children": [
            {
              "title": "视频道具",
              "key": "1-11-1",
              "children": [
                { "title": "浏览视频道具", "key": "1-11-1-1" },
                { "title": "新增视频道具", "key": "1-11-1-2" },
                { "title": "删除视频道具", "key": "1-11-1-3" },
                { "title": "上架", "key": "1-11-1-4" },
                { "title": "下架", "key": "1-11-1-5" }
              ]
            },
            {
              "title": "视频道具分类",
              "key": "1-11-2",
              "children": [
                { "title": "浏览道具分类", "key": "1-11-2-1" },
                { "title": "新增道具分类", "key": "1-11-2-2" },
                { "title": "删除道具分类", "key": "1-11-2-3" },
                { "title": "上架", "key": "1-11-2-4" },
                { "title": "下架", "key": "1-11-2-5" }
              ]
            }
          ]
        },
        {
          "title": "电影模板",
          "key": "1-20",
          "children": [
            { "title": "查看列表", "key": "1-20-1" },
            { "title": "新增模板", "key": "1-20-2" },
            { "title": "删除模板", "key": "1-20-3" },
            { "title": "上架", "key": "1-20-4" },
            { "title": "下架", "key": "1-20-5" }
          ]
        },
        {
          "title": "关键字匹配特效模板",
          "key": "1-21",
          "children": [
            { "title": "查看列表", "key": "1-21-1" },
            { "title": "新增模板", "key": "1-21-2" },
            { "title": "删除模板", "key": "1-22-3" },
            { "title": "编辑模板", "key": "1-22-4" },
            { "title": "上下架", "key": "1-23-5" },
          ]
        },
        {
          "title": "MEME管理",
          "key": "1-12",
          "children": [
            {
              "title": "MEME管理",
              "key": "1-12-1",
              "children": [
                { "title": "浏览MEME", "key": "1-12-1-1" },
                { "title": "新增MEME", "key": "1-12-1-2" },
                { "title": "删除MEME", "key": "1-12-1-3" },
                { "title": "上架", "key": "1-12-1-4" },
                { "title": "下架", "key": "1-12-1-5" }
              ]
            },
            {
              "title": "MEME分类",
              "key": "1-12-2",
              "children": [
                { "title": "浏览MEME分类", "key": "1-12-2-1" },
                { "title": "新增MEME分类", "key": "1-12-2-2" },
                { "title": "删除MEME分类", "key": "1-12-2-3" },
                { "title": "上架", "key": "1-12-2-4" },
                { "title": "下架", "key": "1-12-2-5" }
              ]
            },
            {
              "title": "MEME分类分组",
              "key": "1-12-3",
              "children": [
                { "title": "浏览MEME分类分组", "key": "1-12-3-1" },
                { "title": "新增MEME分类分组", "key": "1-12-3-2" },
                { "title": "删除MEME分类分组", "key": "1-12-3-3" },
                { "title": "上架", "key": "1-12-3-4" },
                { "title": "下架", "key": "1-12-3-5" }
              ]
            }
          ]
        },
        {
          "title": "小秘书",
          "key": "1-13",
          "children": [
            {
              "title": "小秘书官方消息",
              "key": "1-13-1",
              "children": [
                { "title": "新增官方推送", "key": "1-13-1-1" },
                { "title": "删除官方推送", "key": "1-13-1-2" },
                { "title": "编辑官方推送", "key": "1-13-1-3" }
              ]
            },
            {
              "title": "小秘书用户反馈",
              "key": "1-13-2",
              "children": [
                { "title": "回复", "key": "1-13-2-1" }
              ]
            },
            {
              "title": "小秘书回复模板",
              "key": "1-13-3",
              "children": [
                { "title": "添加", "key": "1-13-3-1" },
                { "title": "修改", "key": "1-13-3-2" },
                { "title": "删除", "key": "1-13-3-3" },
              ]
            },
          ]
        },
        {
          "title": "群组管理",
          "key": "1-18",
          "children": [
            {
              "title": "群组列表",
              "key": "1-18-1",
              "children": [
                { "title": "浏览群组列表", "key": "1-18-1-1" },
                { "title": "新增群组", "key": "1-18-1-2" },
                { "title": "删除群组", "key": "1-18-1-3" },
                { "title": "设置推荐位置", "key": "1-18-1-4" },
              ]
            },
            {
              "title": "群组标签管理",
              "key": "1-18-2",
              "children": [
                { "title": "浏览群组标签", "key": "1-18-2-1" },
                { "title": "新增标签", "key": "1-18-2-2" },
                { "title": "删除标签", "key": "1-18-2-3" },
                { "title": "上架", "key": "1-18-2-4" },
                { "title": "下架", "key": "1-18-2-5" }
              ]
            },
            {
              "title": "群组素材管理",
              "key": "1-18-3",
              "children": [
                { "title": "浏览素材", "key": "1-18-3-1" },
                { "title": "新增素材", "key": "1-18-3-2" },
                { "title": "删除素材", "key": "1-18-3-3" },
                { "title": "上架", "key": "1-18-3-4" },
                { "title": "编辑小权限", "key": "1-18-3-5" },
                { "title": "编辑大权限", "key": "1-18-3-6" }
              ]
            }
          ]
        },
        {
          "title": "官方素材",
          "key": "1-1",
          "children": [
            {
              "title": "图片管理",
              "key": "1-1-1",
              "children": [
                { "title": "浏览", "key": "1-1-1-1" },
                { "title": "新建图片", "key": "1-1-1-2" },
                { "title": "编辑", "key": "1-1-1-3" },
                { "title": "删除", "key": "1-1-1-4" }
              ]
            },
            {
              "title": "分组管理",
              "key": "1-1-2",
              "children": [
                { "title": "查询分组", "key": "1-1-2-1" },
                { "title": "新建分组", "key": "1-1-2-2" },
                { "title": "编辑分组", "key": "1-1-2-3" },
                { "title": "删除分组", "key": "1-1-2-4" }
              ]
            },
            {
              "title": "素材管理",
              "key": "1-1-3",
              "children": [
                { "title": "查询素材", "key": "1-1-3-1" },
                { "title": "新建素材", "key": "1-1-3-2" },
                { "title": "编辑素材", "key": "1-1-3-3" },
                { "title": "删除素材", "key": "1-1-3-4" }
              ]
            },
          ]
        },
        {
          "title": "投放成本管理",
          "key": "1-14",
          "children": [
            { "title": "查询数据", "key": "1-14-1" },
            { "title": "导入数据", "key": "1-14-2" },
            { "title": "下载模板", "key": "1-14-3" },
          ]
        },
        {
          "title": "语音房标签管理",
          "key": "1-15",
          "children": [
            { "title": "查询数据", "key": "1-15-1" },
            { "title": "新增数据", "key": "1-15-2" },
            { "title": "编辑模板", "key": "1-15-3" },
          ]
        },
        {
          "title": "主播管理",
          "key": "1-6",
          "children": [
            {
              "title": "主播",
              "key": "1-6-1",
              "children": [
                { "title": "查询", "key": "1-6-1-1" },
                { "title": "编辑", "key": "1-6-1-2" },
              ]
            },
            {
              "title": "MCN",
              "key": "1-6-2",
              "children": [
                { "title": "查询", "key": "1-6-2-1" },
                { "title": "编辑", "key": "1-6-2-2" },
                { "title": "添加", "key": "1-6-2-2" },
                { "title": "删除", "key": "1-6-2-2" },
              ]
            },
            {
              "title": "MCN底薪管理",
              "key": "1-6-3",
              "children": [
                { "title": "查询", "key": "1-6-3-1" },
              ]
            },
          ]
        },
        // {
        //   "title": "道具分类",
        //   "key": "1-10",
        //   "children": [
        //     { "title": "查询道具分类", "key": "1-10-1" },
        //     { "title": "新建道具分类", "key": "1-10-2" },
        //     { "title": "编辑道具分类", "key": "1-10-3" },
        //     { "title": "删除道具分类", "key": "1-10-4" }
        //   ]
        // },
        // {
        //   "title": "道具管理",
        //   "key": "1-9",
        //   "children": [
        //     { "title": "查询道具分类", "key": "1-9-1" },
        //     { "title": "新建道具分类", "key": "1-9-2" },
        //     { "title": "编辑道具分类", "key": "1-9-3" },
        //     { "title": "删除道具分类", "key": "1-9-4" }
        //   ]
        // }
      ]
    }, {
      "title": "订单管理",
      "key": "5",
      "children": [
        {
          "title": "用户流水查询",
          "key": "5-4",
          "children": [
            { "title": "用户流水查询", "key": "5-4-1" }
          ]
        },
        {
          "title": "礼物订单",
          "key": "5-5",
          "children": [
            { "title": "购买礼物查询", "key": "5-5-1" }
          ]
        },
        {
          "title": "会员充值",
          "key": "5-1",
          "children": [
            { "title": "查看会员充值订单", "key": "5-1-1" }
          ]
        },
        {
          "title": "钻石充值",
          "key": "5-2",
          "children": [
            { "title": "查看钻石充值订单", "key": "5-2-1" }
          ]
        },
        {
          "title": "提现订单",
          "key": "5-3",
          "children": [
            { "title": "查看提现订单", "key": "5-3-1" },
            { "title": "审核提现订单", "key": "5-3-2" },
          ]
        }
      ]
    },
    {
      "title": "反馈管理",
      "key": "4",
      "children": [
        {
          "title": "反馈分类",
          "key": "4-6",
          "children": [
            { "title": "查询反馈分类", "key": "4-6-1" },
            { "title": "新建反馈分类", "key": "4-6-2" },
            { "title": "编辑反馈分类", "key": "4-6-3" },
            { "title": "删除反馈分类", "key": "4-6-4" }
          ]
        },
        {
          "title": "反馈管理",
          "key": "4-1",
          "children": [
            { "title": "浏览反馈", "key": "4-1-1" },
            { "title": "回复", "key": "4-1-2" },
            { "title": "驳回", "key": "4-1-3" }
          ]
        },
        {
          "title": "FAQ管理",
          "key": "4-3",
          "children": [
            { "title": "浏览FAQ", "key": "4-3-1" },
            { "title": "新建FAQ", "key": "4-3-2" },
            { "title": "编辑FAQ", "key": "4-3-3" },
            { "title": "删除FAQ", "key": "4-3-4" },
            { "title": "上架", "key": "4-3-5" },
            { "title": "下架", "key": "4-3-6" }
          ]
        }
      ]
    }, {
      "title": "系统管理",
      "key": "2",
      "children": [{
        "title": "账号管理",
        "key": "2-1",
        "children": [
          { "title": "浏览", "key": "2-1-1" },
          { "title": "新建账号", "key": "2-1-2" },
          { "title": "编辑账号", "key": "2-1-3" },
          { "title": "删除账号", "key": "2-1-4" }
        ]
      }, {
        "title": "角色管理",
        "key": "2-2",
        "children": [
          { "title": "查询角色", "key": "2-2-1" },
          { "title": "新建角色", "key": "2-2-2" },
          { "title": "编辑角色", "key": "2-2-3" },
          { "title": "删除角色", "key": "2-2-4" }
        ]
      }, {
        "title": "版本管理",
        "key": "2-3",
        "children": [
          { "title": "浏览", "key": "2-3-1" },
          { "title": "新建版本", "key": "2-3-2" },
          { "title": "编辑版本", "key": "2-3-3" },
          { "title": "删除版本", "key": "2-3-4" }
        ]
      }, {
        "title": "全局管理",
        "key": "2-4",
        "children": [
          { "title": "浏览", "key": "2-4-1" },
          { "title": "新建配置", "key": "2-4-2" },
          { "title": "编辑配置", "key": "2-4-3" },
          { "title": "删除配置", "key": "2-4-4" }
        ]
      },
      {
        "title": "h5版本管理",
        "key": "2-5",
        "children": [
          { "title": "浏览", "key": "2-5-1" },
          { "title": "新建配置", "key": "2-5-2" },
          { "title": "编辑配置", "key": "2-5-3" },
          { "title": "删除配置", "key": "2-5-4" }
        ]
      }
      ]
    },
    ],
    "url_map": [
      // { "title": "浏览图片", "key": "1-1-1", "url": "" },
      // { "title": "新建图片", "key": "1-1-2", "url": "" },
      // { "title": "编辑图片", "key": "1-1-3", "url": "" },
      // { "title": "删除图片", "key": "1-1-4", "url": "" },
      // { "title": "查询分组", "key": "1-2-1", "url": "" },
      // { "title": "新建分组", "key": "1-2-2", "url": "" },
      // { "title": "编辑分组", "key": "1-2-3", "url": "" },
      // { "title": "删除分组", "key": "1-2-4", "url": "" },
      // { "title": "浏览用户", "key": "1-4-1", "url": "" },
      // { "title": "冻结用户", "key": "1-4-2", "url": "" },
      // { "title": "查询素材", "key": "1-7-1" },
      // { "title": "新建素材", "key": "1-7-2" },
      // { "title": "编辑素材", "key": "1-7-3" },
      // { "title": "删除素材", "key": "1-7-4" },
      // { "title": "查询道具分类", "key": "1-10-1" },
      // { "title": "新建道具分类", "key": "1-10-2" },
      // { "title": "编辑道具分类", "key": "1-10-3" },
      // { "title": "删除道具分类", "key": "1-10-4" },
      // { "title": "查询道具", "key": "1-9-1" },
      // { "title": "新建道具", "key": "1-9-2" },
      // { "title": "编辑道具", "key": "1-9-3" },
      // { "title": "删除道具", "key": "1-9-4" },
      // { "title": "浏览账号", "key": "2-1-1", "url": "" },
      // { "title": "新建账号", "key": "2-1-2", "url": "" },
      // { "title": "编辑账号", "key": "2-1-3", "url": "" },
      // { "title": "删除账号", "key": "2-1-4", "url": "" },
      // { "title": "查询角色", "key": "2-2-1", "url": "" },
      // { "title": "新建角色", "key": "2-2-2", "url": "" },
      // { "title": "编辑角色", "key": "2-2-3", "url": "" },
      // { "title": "删除角色", "key": "2-2-4", "url": "" },
      // { "title": "浏览版本", "key": "2-3-1", "url": "" },
      // { "title": "新建版本", "key": "2-3-2", "url": "" },
      // { "title": "编辑版本", "key": "2-3-3", "url": "" },
      // { "title": "删除版本", "key": "2-3-4", "url": "" },
      // { "title": "浏览配置", "key": "2-4-1", "url": "" },
      // { "title": "新建配置", "key": "2-4-2", "url": "" },
      // { "title": "编辑配置", "key": "2-4-3", "url": "" },
      // { "title": "删除配置", "key": "2-4-4", "url": "" },
      // { "title": "节点浏览", "key": "3-1-1", "url": "" },
      // { "title": "新建节点", "key": "3-1-2", "url": "" },
      // { "title": "编辑节点", "key": "3-1-3", "url": "" },
      // { "title": "删除节点", "key": "3-1-4", "url": "" },
      // { "title": "浏览反馈", "key": "4-1-1", "url": "" },
      // { "title": "回复", "key": "4-1-2", "url": "" },
      // { "title": "驳回", "key": "4-1-3", "url": "" },
      // { "title": "浏览FAQ", "key": "4-3-1", "url": "" },
      // { "title": "新建FAQ", "key": "4-3-2", "url": "" },
      // { "title": "编辑FAQ", "key": "4-3-3", "url": "" },
      // { "title": "删除FAQ", "key": "4-3-3", "url": "" },
      // { "title": "上架", "key": "4-3-5", "url": "" },
      // { "title": "下架", "key": "4-3-6", "url": "" },
      // { "title": "查询反馈分类", "key": "4-6-1" },
      // { "title": "新建反馈分类", "key": "4-6-2" },
      // { "title": "编辑反馈分类", "key": "4-6-3" },
      // { "title": "删除反馈分类", "key": "4-6-4" },
      // { "title": "浏览视频道具", "key": "1-11-1-1" },
      // { "title": "新增视频道具", "key": "1-11-1-2" },
      // { "title": "删除视频道具", "key": "1-11-1-3" },
      // { "title": "上架", "key": "1-11-1-4" },
      // { "title": "下架", "key": "1-11-1-5" },
      // { "title": "浏览道具分类", "key": "1-11-2-1" },
      // { "title": "新增道具分类", "key": "1-11-2-2" },
      // { "title": "删除道具分类", "key": "1-11-2-3" },
      // { "title": "上架", "key": "1-11-2-4" },
      // { "title": "下架", "key": "1-11-2-5" },
      // { "title": "浏览MEME", "key": "1-12-1-1" },
      // { "title": "新增MEME", "key": "1-12-1-2" },
      // { "title": "删除MEME", "key": "1-12-1-3" },
      // { "title": "上架", "key": "1-12-1-4" },
      // { "title": "下架", "key": "1-12-1-5" },
      // { "title": "浏览MEME分类", "key": "1-12-2-1" },
      // { "title": "新增MEME分类", "key": "1-12-2-2" },
      // { "title": "编辑MEME分类", "key": "1-12-2-3" },
      // { "title": "删除MEME分类", "key": "1-12-2-4" },
      // { "title": "上架", "key": "1-12-2-4" },
      // { "title": "下架", "key": "1-12-2-5" },
      // { "title": "浏览MEME分类分组", "key": "1-12-3-1" },
      // { "title": "新增MEME分类分组", "key": "1-12-3-2" },
      // { "title": "编辑MEME分类分组", "key": "1-12-3-3" },
      // { "title": "删除MEME分类分组", "key": "1-12-3-4" },
      // { "title": "上架", "key": "1-12-3-4" },
      // { "title": "下架", "key": "1-12-3-5" },
      // { "title": "新增官方推送", "key": "1-13-1" },
      // { "title": "浏览官方推送", "key": "1-13-2" },
      // { "title": "编辑官方推送", "key": "1-13-3" },
      // { "title": "删除官方推送", "key": "1-13-4" },
      // { "title": "回复", "key": "1-14-1" },
      // { "title": "浏览虚拟账号", "key": "1-15-1" },
      // { "title": "新增虚拟账号", "key": "1-15-2" },
      // { "title": "编辑虚拟账号", "key": "1-15-3" },
      // { "title": "删除虚拟账号", "key": "1-15-4" },
      // { "title": "浏览群组列表", "key": "1-18-1-1" },
      // { "title": "新增群组", "key": "1-18-1-2" },
      // { "title": "删除群组", "key": "1-18-1-3" },
      // { "title": "设置推荐位置", "key": "1-18-1-4" },
      // { "title": "浏览群组标签", "key": "1-18-2-1" },
      // { "title": "新增标签", "key": "1-18-2-2" },
      // { "title": "删除标签", "key": "1-18-2-3" },
      // { "title": "上架", "key": "1-18-2-4" },
      // { "title": "下架", "key": "1-18-2-5" },
      // { "title": "浏览素材", "key": "1-18-3-1" },
      // { "title": "新增素材", "key": "1-18-3-2" },
      // { "title": "删除素材", "key": "1-18-3-3" },
      // { "title": "上架", "key": "1-18-3-4" },
      // { "title": "小权限", "key": "1-18-3-5" },
      // { "title": "大权限", "key": "1-18-3-6" },
    ]
  }
}